**** DONE Assessing the strategies
CLOSED: [2021-01-26 Tue 19:36]
+ So far I have had medium-size data sets, which have allowed the use of inefficient algorithms using pandas
+ Sizes of datsets
  + Damiani:2016a Carina
    + 866 spatial points
  + Damiani:2017b Lagoon
    + 1177 spatial points
  + Castro:2018a Tarantula (30 Dor)
    + 649 x 649 pixels => 421201 points
    + This is 400 x what I was doing before
  + Estimate of memory requirement to store all the pairs (assume 8 bytes per number)
    | N points | pairs = N^2 / 2 | Memory (GB) |
    |----------+----------------+-------------|
    |     1000 |         500000 |      0.0037 |
    |   421000 |    88620500000 |    660.2742 |
    #+TBLFM: $2=$1*$1/2::$3=8 $2 / 1024**3 ; f4
  + So that is not feasible - need to use the more efiicient algorithm.
  + Based on my tests so far, I estimate that the numba parallel algorithm should be able to do the Tarantula structure function in 27.2 (649/400)**4 = 188.5 s, or 3 minutes
    + *So that is fine*
** Comparison between regions
|             |     Q_H |  L(Ha) |    SFR |   n | R_S, pc | L, pc |   \Sigma_SFR | \ell_0, pc |   \sigma |    m | D, kpc |
|-------------+--------+--------+--------+-----+--------+-------+--------+--------+-----+------+--------|
| Orion       |   1e49 | 1.2e37 | 5.3e-5 | 1e4 |  0.101 |   0.6 | 46.862 |   0.05 | 3.1 |  1.1 |    0.4 |
| Orion large |   1e49 | 1.2e37 | 5.3e-5 | 100 |  2.184 |     4 |  1.054 |        |     |      |    0.4 |
| M8 small    |   2e49 | 2.3e37 | 1.0e-4 | 600 |  0.833 |    20 |  0.080 |    1.3 |   3 |  0.8 |    1.3 |
| M8 large    |   2e49 | 2.3e37 | 1.0e-4 |  60 |  3.868 |    20 |  0.080 |      6 |   4 |    1 |    1.3 |
| Carina      |   2e51 | 2.3e39 | 1.0e-2 | 500 |  4.368 |    15 | 14.147 |    0.5 |   4 |  0.7 |    2.0 |
| 30 Dor      | 2.5e51 | 2.9e39 | 1.3e-2 | 500 |  4.705 |    30 |  4.598 |    2.7 |  16 | 1.22 |     50 |
| NGC 604 T   |   1e51 | 1.2e39 | 5.3e-3 |  50 | 16.092 |   400 |  0.011 |     11 | 7.3 |  1.7 |    840 |
| NGC 595     |   5e50 | 5.8e38 | 2.6e-3 |  50 | 12.772 |   300 |  0.009 |     11 | 6.6 |  1.7 |    840 |
| Hubble V    |   3e49 | 3.5e37 | 1.5e-4 |  90 |  3.379 |   100 |  0.005 |    3.6 | 2.8 |  1.8 |    500 |
| Hubble X    |   6e49 | 7.0e37 | 3.1e-4 |  30 |  8.856 |   150 |  0.004 |    4.7 | 3.6 |  1.7 |    500 |
#+TBLFM: $3=$2/ 8.56e+11 ;s2::$4=4.424e-42 $3;s2::$6=($2 / 4 $pi 2.6e-13 $5**2 )**(1/3) / $pc;f3::$8=$4 / $pi ($7/1000)**2 ;f3


More recent census of stars in 30 Doradus gives slightly larger QH - Bestenlehner:2020a give 2.75e+51 /s

L(Ha) = (h\nu) \alpha_Ha VEM
Q_H = \alpha_B VEM = L(Ha) \alpha_B/\alpha_eff 1/h\nu

h\nu = 13.6 (1/4 - 1/9) eV = 3.026e-12 erg
\alpha_B / \alpha_eff = 2.6 

Q_H = 8.56e+11 L(Ha)

NGC 604: L(Ha) = 1e39 => Q_H = 1e51 erg
NGC 595: L(Ha) = 

Hubble V: L(Ha) = 1e49 en fotones => Q(H) = 2.6e49
Hubble X: L(Ha) = 2.4e49 en fotones => Q(H) = 6.24e49


